
<?php
// Отримання значень $a та $b з адресного рядка
$a = $_GET['a'] ?? 0; // Встановлення значення за замовчуванням 0
$b = $_GET['b'] ?? 0; // Встановлення значення за замовчуванням 0

// Перевірка, чи введено числа
if (!is_numeric($a) || !is_numeric($b)) {
    echo "Будь ласка, введіть числа.";
} else {
    // Виведення результатів математичних операцій
    echo "Сума: " . ($a + $b) . "<br>";
    echo "Добуток: " . ($a * $b) . "<br>";
    
    // Різниця
    echo "Різниця (a - b): " . ($a - $b) . "<br>";
    
    // Перевірка, чи друге число не є нулем перед виконанням ділення
    if ($b != 0) {
        echo "Частка (a / b): " . ($a / $b);
    } else {
        echo "Друге число не може бути нулем для виконання операції ділення.";
    }
}
?>